In [1]:
import pandas as pd
import sqlite3

In [2]:
con = sqlite3.connect('C:/Users/79295/Desktop/GITHUB/SQL/SQL для анализа данных/databases/german_credit.db')

In [17]:
df = pd.read_csv('C:/Users/79295/Desktop/GITHUB/SQL/SQL для анализа данных/datasets/german_credit_augmented.csv')

In [4]:
df.contract_dt = pd.to_datetime(df.contract_dt, format='%Y-%m-%d %H:%M:%S')

In [5]:
# Выгружаем нашу табличку в базу данных

df.to_sql('german_credit', con, index=False,if_exists='replace')

1000

In [6]:
# Заворачиваем функцию  pd.read_sql(sql,con) во вспомогательную функцию select(sql), чтобы меньше печатать 

def select(sql):
    return pd.read_sql(sql,con)

In [35]:
sql = '''select
        t.*,
        t.age * 3 as age_mult3
        from german_credit t
        where t.age < 23 
        and t.purpose = "car"
        and t.housing = "own"
        '''
select(sql)

,age,sex,job,housing,saving_accounts,checking_account,credit_amount,duration,purpose,default,contract_dt,client_id,age_mult3
0,22,male,2,own,rich,moderate,1007,12,car,0,2007-07-17 12:33:24,67,66

In [36]:
sql = '''select
        t.*,
        t.age * 3 as age_mult3
        from german_credit t
        where t.age < 22 
        and t.purpose = "car"
        and t.housing in ("own","rent")
        '''
select(sql)

,age,sex,job,housing,saving_accounts,checking_account,credit_amount,duration,purpose,default,contract_dt,client_id,age_mult3
0,21,female,2,rent,little,None,2570,27,car,1,2008-06-14 22:03:03,724,63
1,20,female,2,rent,None,None,4675,12,car,0,2008-06-06 19:31:48,296,60
2,21,male,2,rent,little,moderate,2779,18,car,0,2008-06-06 15:51:39,425,63
3,20,female,2,rent,rich,None,3186,15,car,0,2008-05-06 18:34:56,420,60
4,20,female,1,rent,little,moderate,2718,24,car,1,2008-04-12 12:34:40,593,60

*Сохраним результат запроса в новую табличку*

In [39]:
cur = con.cursor()

In [50]:
# Создадим запрос в котором сначала будем дропать табличку, чтобы оставалась возможность перезапуска

In [46]:
sql = '''
    drop table if exists my_table; 
    create table my_table as 
    select
    t.*,
    t.age * 3 as age_mult3
    from german_credit t
    where t.age < 22 
    and t.purpose = "car"
    and t.housing in ("own","rent")
    '''

In [47]:
cur.executescript(sql)

In [48]:
sql = '''
select *
from my_table
'''

In [49]:
select(sql)

,age,sex,job,housing,saving_accounts,checking_account,credit_amount,duration,purpose,default,contract_dt,client_id,age_mult3
0,21,female,2,rent,little,None,2570,27,car,1,2008-06-14 22:03:03,724,63
1,20,female,2,rent,None,None,4675,12,car,0,2008-06-06 19:31:48,296,60
2,21,male,2,rent,little,moderate,2779,18,car,0,2008-06-06 15:51:39,425,63
3,20,female,2,rent,rich,None,3186,15,car,0,2008-05-06 18:34:56,420,60
4,20,female,1,rent,little,moderate,2718,24,car,1,2008-04-12 12:34:40,593,60